entries/default.org
#+hugo_base_dir: ../
#+STARTUP: content
#+macro: latex @@html:<span class="latex">L<sup>A</sup>T<sub>E</sub>X</span>@@
#+options: ^:{}
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))

** DONE 記事の Org file にリンクを貼る                                :@hugo:
   CLOSED: [2018-09-03 Mon 17:02]
:PROPERTIES:
:EXPORT_FILE_NAME: a-link-to-the-original-org-source-file
:EXPORT_HUGO_TAGS: "orgmode"
:CREATED:  [2018-09-03 Mon 16:55]
:END:

せっかく [[https://github.com/kaushalmodi/ox-hugo][ox-hugo]] で記事を書いているので，Hugo記事のソースとなる orgfile を明示したい．

毎度手動でそのリンクを生成するのは面倒なので，マクロで実現してみる．

まず，マクロから呼び出す関数を書く．

#+begin_src emacs-lisp
(defun org-hugo-get-link-to-orgfile (uri alt)
      "Return a formatted link to the original Org file in Github."
      (let ((line (save-excursion
                    (save-restriction
                      (unless (org-at-heading-p)
                        (org-previous-visible-heading 1))
                      (line-number-at-pos)))))
        (concat "[[" uri (file-name-nondirectory (buffer-file-name))
                "#L" (format "%d" line) "][" alt "]]")))
#+end_src

で，これを，編集中の orgfile の =#+macro= で使う．こんな感じ．

#+begin_src org
#+macro: srclink (eval (org-hugo-get-link-to-orgfile "https://github.com/takaxp/blog/blame/master/entries/" "see Orgfile"))
#+end_src

第一引数を，ソースを配置するサイトのURI．ファイル名の直前までを指定する．スラッシュを忘れずに．

第二引数に，HTML上で表示されるリンク名を指定する．

そして，記事の執筆時に，以下を埋め込めば，対応するソース（行単位）に転送してくれるリンクがエクスポート時に勝手に埋め込まれる．

#+begin_src org
{{{srclink}}}
#+end_src

しばらくこれで運用してみる．

[[https://github.com/takaxp/blog/blame/master/entries/default.org#L485][see Orgfile]]

*** Updated (2018-09-04@00:44)

このアプローチだと不十分とわかった．同じファイルの別箇所を編集したときに，headingの行がズレるが，このマクロが含まれているすべての subtree を更新しなければそのズレを反映させられない．ｸﾏｯﾀ...
